prompt === Package GD_Emp_Pkg ===

create or replace
package GD_Emp_Pkg is
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Отдел кадров
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Получение работодателя по ИНН
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
function Get_Employer(pINN in GD_Emp_Employer.inn%type) -- ИНН
return GD_Emp_Employer%RowType;
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Регистрация
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
procedure Registration(pName        in GD_Emp_Personnel.name%type   ,  -- Ф.И.О.
                       pSNILS       in GD_Emp_Personnel.snils%type  ,  -- СНИЛС
                       pPostId      in GD_Emp_Personnel.post_id%type,  -- Id должности
                       pEmployerINN in GD_Emp_Employer.inn%type     ,  -- ИНН работодателя
                       pPIN         in VarChar2                     ,  -- Пароль
                       pId             out GD_Emp_Personnel.id%type ,  -- Id
                       pResult         out Integer                  ,  -- Результат (0 - OK, иначе ошибка)
                       pErrMes         out VarChar2                 ); -- Сообщение об ошибке
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
end;
/

create or replace
package body GD_Emp_Pkg is
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Отдел кадров
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Получение работодателя по ИНН
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
function Get_Employer(pINN in GD_Emp_Employer.inn%type) -- ИНН
return GD_Emp_Employer%RowType is
  rEmployer GD_Emp_Employer%RowType;
begin
  select GD_Emp_Employer.*
    into rEmployer
    from GD_Emp_Employer
    where GD_Emp_Employer.inn=pINN;
  return rEmployer;
end;
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Регистрация
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
procedure Registration(pName        in GD_Emp_Personnel.name%type   ,    -- Ф.И.О.
                       pSNILS       in GD_Emp_Personnel.snils%type  ,    -- СНИЛС
                       pPostId      in GD_Emp_Personnel.post_id%type,    -- Id должности
                       pEmployerINN in GD_Emp_Employer.inn%type     ,    -- ИНН работодателя
                       pPIN         in VarChar2                     ,    -- Пароль
                       pId             out GD_Emp_Personnel.id%type ,    -- Id
                       pResult         out Integer                  ,    -- Результат (0 - OK, иначе ошибка)
                       pErrMes         out VarChar2                 ) is -- Сообщение об ошибке
  rPersonnel GD_Emp_Personnel%RowType;
begin
  rPersonnel.name:=pName;
  rPersonnel.snils:=pSNILS;
  rPersonnel.pin:=GD_Security_Pkg.Get_MD5(pPIN);
  insert into GD_Emp_Personnel
    values rPersonnel
    returning id into pId;
  pResult:=0;
exception
  when Others then
    pErrMes:=SQLErrM;
    pResult:=-1;
end;
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
end;
/
