prompt === Package GD_Security_Pkg ===

create or replace
package GD_Security_Pkg is
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Безопасность
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Получение хэша
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
function Get_MD5(p in VarChar2)
return VarChar2;
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Авторизация
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
procedure Authorisation(pSNILS       in     GD_Emp_Personnel.snils%type,  -- СНИЛС
                        pPIN         in     VarChar2                   ,  -- Пароль
                        pMacAddress  in     GD_Gadget.mac_address%type ,  -- MAC адрес
                        pEmployeeId     out GD_Employee.id%type        ,  -- Id работника
                        pResult         out Integer                    ,  -- Результат (0 - OK, иначе ошибка)
                        pErrMes         out VarChar2                   ); -- Сообщение об ошибке
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
end;
/

create or replace
package body GD_Security_Pkg is
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Безопасность
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
E_Fake exception;
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Получение хэша
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
function Get_MD5(p in VarChar2)
return VarChar2 is
begin
  return Utl_Raw.Cast_To_VarChar2(Sys.DBMS_Obfuscation_Toolkit.MD5(input=>Utl_Raw.Cast_To_Raw(p)));
end;
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- Авторизация
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
procedure Authorisation(pSNILS       in     GD_Emp_Personnel.snils%type,    -- СНИЛС
                        pPIN         in     VarChar2                   ,    -- Пароль
                        pMacAddress  in     GD_Gadget.mac_address%type ,    -- MAC адрес
                        pEmployeeId     out GD_Employee.id%type        ,    -- Id работника
                        pResult         out Integer                    ,    -- Результат (0 - OK, иначе ошибка)
                        pErrMes         out VarChar2                   ) is -- Сообщение об ошибке
  rPersonnel GD_Emp_Personnel%RowType;
  rEmployee  GD_Employee%RowType;
  rGadget    GD_Gadget%RowType;
begin
  rPersonnel:=GD_Emp_Api_Pkg.Get_Personnel_By_SNILS(pSNILS);
  if Get_MD5(pPIN)!=rPersonnel.pin then
    pErrMes:='Неверный ПИН';
    raise E_Fake;
  end if;
  rGadget:=GD_Api_Pkg.Get_Gadget_By_Mac_Address(pMacAddress);
  select GD_Employee.id
    into pEmployeeId
    from GD_Employee
    where GD_Employee.gadget_id=rGadget.id and
          GD_Employee.employee_id=rPersonnel.id;
  pResult:=0;
exception
  when E_Fake then
    pResult:=-1;
  when Others then
    pErrMes:=SQLErrM;
    pResult:=-1;
end;
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
end;
/
